# HvacRoughness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..HvacRoughness Property
SpecTypeId Class See Also
---
Roughness, in discipline HVAC.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId HvacRoughness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HvacRoughness As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ HvacRoughness {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace